# SteelElemHoleDefinition Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SteelElemHoleDefinition Property
ParameterTypeId Class See Also
---
"Hole Definition"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SteelElemHoleDefinition { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SteelElemHoleDefinition As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SteelElemHoleDefinition {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace